name: "cls_image_riot_resnet18_onnx_model"
platform: "onnxruntime_onnx"
default_model_filename: "riot_check_resnet18_v1.0.1.onnx"
max_batch_size: 0
input [
  {
    name: "input.1"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 224, 224]
    reshape: {shape: [1, 3, 224, 224]}
  }
]

output [
  {
    name: "199"
    data_type: TYPE_FP32
    dims: [1, 4]
  }
]
